[
  {
    "id": 1,
    "title": "Climate change 'beyond scientific dispute,' National Academies report says",
    "url": "https://www.politico.com/news/2025/09/17/climate-change-beyond-scientific-dispute-national-academies-report-says-00568552",
    "content": "A new report from the National Academies of Sciences, Engineering and Medicine (NASEM) asserts that the scientific evidence for climate change is \"beyond scientific dispute\" and that the United States is already experiencing worsening impacts. The study emphasizes that human activities, particularly greenhouse gas emissions, are unequivocally warming the planet, and that current climate extremes will become normal if emissions continue unchecked."
  },
  {
    "id": 2,
    "title": "Human-induced climate change amplifies heatwaves; carbon majors to blame: Study",
    "url": "https://timesofindia.indiatimes.com/india/human-induced-climate-change-amplifies-heatwaves-carbon-majors-to-blame-study/articleshow/123939658.cms",
    "content": "A new study analyzing 213 heatwaves across 63 countries from 2000 to 2023 has found that human-induced climate change is significantly increasing their frequency and intensity. The research highlights the direct link between emissions from major fossil fuel companies—known as \"carbon majors\"—and the escalating severity of heatwaves worldwide. India, which experienced eight of these heatwaves during the study period, is notably affected."
  },
  {
    "id": 3,
    "title": "Australia's new climate target revealed, nation reacts",
    "url": "https://www.news.com.au/technology/environment/australias-new-climate-target-revealed/news-story/b52681ae6944347ba0ed2e061c16199a",
    "content": "The Australian government has announced a new 2035 greenhouse gas emissions reduction target of 62-70% below 2005 levels, amid mixed reactions across political, environmental, and industrial sectors. Prime Minister Anthony Albanese defended the target as \"responsible\" and aligned with scientific advice, highlighting potential economic benefits including lower electricity prices and increased investments. However, critics say the target lacks ambition."
  },
  {
    "id": 4,
    "title": "Cleveland launches first-ever Tech Week to spotlight innovation",
    "url": "https://www.axios.com/local/cleveland/2025/09/15/inaugural-tech-week-innovation",
    "content": "Cleveland has launched its first-ever Tech Week to highlight and promote the region's expanding technology ecosystem. Beginning Monday, the week-long event features approximately 30 events spread across various venues, aimed at fostering awareness, networking, and investment in local tech companies. The initiative was spearheaded by local entrepreneur McKelvey Packard, co-founder of smartkey company Everykey. Tech Week has garnered solid support from prominent regional organizations like the Greater Cleveland Partnership, MAGNET, and Global Cleveland."
  },
  {
    "id": 5,
    "title": "Climate change 'beyond scientific dispute,' National Academies report says",
    "url": "https://apnews.com/article/02539335c8316dd1d430e4411d5d6cb0",
    "content": "In a strong rebuke to the policies that sought to weaken environmental protections, the National Academy of Sciences reaffirmed that human-caused climate change poses a direct threat to public health, citing overwhelming evidence of intensifying wildfires, rising sea levels, and growing health risks due to extreme weather and air pollution. The NAS emphasized the need to maintain and strengthen regulatory standards."
  }
]
